[
  {
    "sys.exit()": "cierra la aplicacion.",
    "sys.version": "muestra la version actual de python.",
    "os.system(arg) and os.popen(arg)": "levantan comandos subprocesos; solo que la segunda permite guardar los outputs del comando.",
    "os.getcwd()": "retorna la direccion de la carpeta actual(cwd=current working directory).",
    "os.path.realpath(arg)": "retorna la direccion completa de arg; __file__ para el archivo en uso; \".\" para carpeta actual.",
    "sys.platform": "muestra en que plataforma se está corriendo(linux,win,etc).",
    "sys.path": "devuelve una lista con todo los directorios de PYTHONPATH, que puede ser cambiada para que python sepa de donde importar pero sólo dura mientras este programa se corre, después se reinicia.",
    "os.chdir(arg)": "para cambiar directorio hasta y trabajar en el hasta que finalice el programa(change directory).",
    "os.listdir(arg)": "lista todo en la carpeta, se le puede pasar dirección como argumento o mediante *.extension para buscar especifico por extension.",
    "os.sep": "devuelve el separador de paths del sistema operativo.",
    "os.path.isdir(arg) and os.path.isfile(arg)": "devuelve un booleano si es un directorio o no O si es un archivo o no,repect.",
    "os.path.exists(arg)": "devuelve un booleano si existe o no.",
    "os.path.split(arg)": "divide el path en dos (head,tail), donde tail es todo después del último separetor(/,\\) y head es lo que hay antes.",
    "os.mkdir(arg) and os.rmdir(arg)": "crea o elimina una carpeta respect.",
    "sys.argv": "devuelve una lista con los argumentos que se pasaron a la hora e ejecutar el script.v",
    "sys.stdin()": "toma los valores del teclado, es la forma de entrada default(Standard input)(se usa con read()).Para pasarle un archivo como input se utiliza '< archivo' como argumento al levantar el archivo.",
    "sys.stdout()": "muestra los valores a pantalla(print)(Standard output).Para que el output vaya a un archivo se utiliza '> archivo' como argumento al levantar el archivo en la shell.",
    "os.write(fileno,b'arg')": "otra forma de redireccionar stdout, si fileno>=3 es para archivos cargados, deben ir encodeados.",
    "os.rename(file,arg)": "le cambia el nombre a un archivo a arg.",
    "os.remove(arg)": "remueve un archivo.",
    "os.walk(dir)": "devuelve una tupla con tres elementos: dir_actual,subdirectorios,archivos; es un generador que transversa carpetas llamando listdir en cada una.",
    "_thread.start_new_thread(func,(args))": "levanta un nuevo hilo dentro del programa, se le pasa la función y los args mediante una tupla.",
    "_thread.allocate_lock()": "se guarda en una variable para guardarlo como un objeto,se utiliza para sincronizar threads bloqueando y liberando el acceso mediante .acquire() and .release() respectivamente.",
    "threading.Lock()": "sinonimo de _thread.allocate_lock() para OOP.",
    "queue.Queue()": "para inicializar el dipocket, para comunicarse entre threads; obj.put(arg): para guardar cosas; obj.get(block=False): para recoger lo que haya dentro.",
    "threading.Thread(target=,args=)": "para levantar threads a alto nivel; target= function y args= tupla de los argumentos; obj.join(): espera a que los children termine; obj.start(): inicializa el hilo.",
    "multiprocessing.Process(target=,args=)": "para levantar procesos a alto nivel; target= function y args= tupla de los argumentos; obj.join(): espera a que los children termine; obj.start(): inicializa el proceso.",
    "multiprocessing.Pipe()": "para comunicacion entre programas;devuelve una tupla de (parent,child) que permite enviar y recibir mediante obj.send() and obj.recv()(que espera hasta que haya algo para recibir).",
    "os.startfile(arg)": "para levantar programas mediante os."
  }
]